ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/ADC_SAFETY_ADC_SAFETY_AGGR_502CEC00h.xml
<module name="ADC_SAFETY_AGGR" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ADC_SAFETY_AGGR_OOTFLG" acronym="ADC_SAFETY_AGGR_OOTFLG" offset="0" width="32" description="Checker Out-of-Tolerance Flag Register.">
		<bitfield id="OOT12" width="1" begin="11" end="11" resetval="0x0" description="ADC results safety checker 12 out-of-tolerance flag.  Set when CHECK12 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="11" rwaccess="R"/>
	<bitfield id="OOT11" width="1" begin="10" end="10" resetval="0x0" description="ADC results safety checker 11 out-of-tolerance flag.  Set when CHECK11 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="10" rwaccess="R"/>
	<bitfield id="OOT10" width="1" begin="9" end="9" resetval="0x0" description="ADC results safety checker 10 out-of-tolerance flag.  Set when CHECK10 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="9" rwaccess="R"/>
	<bitfield id="OOT9" width="1" begin="8" end="8" resetval="0x0" description="ADC results safety checker 1 out-of-tolerance flag.  Set when CHECK9 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="8" rwaccess="R"/>
	<bitfield id="OOT8" width="1" begin="7" end="7" resetval="0x0" description="ADC results safety checker 8 out-of-tolerance flag.  Set when CHECK8 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="7" rwaccess="R"/>
	<bitfield id="OOT7" width="1" begin="6" end="6" resetval="0x0" description="ADC results safety checker 7 out-of-tolerance flag.  Set when CHECK7 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="6" rwaccess="R"/>
	<bitfield id="OOT6" width="1" begin="5" end="5" resetval="0x0" description="ADC results safety checker 6 out-of-tolerance flag.  Set when CHECK6 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="5" rwaccess="R"/>
	<bitfield id="OOT5" width="1" begin="4" end="4" resetval="0x0" description="ADC results safety checker 5 out-of-tolerance flag.  Set when CHECK5 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="4" rwaccess="R"/>
	<bitfield id="OOT4" width="1" begin="3" end="3" resetval="0x0" description="ADC results safety checker 4 out-of-tolerance flag.  Set when CHECK4 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="3" rwaccess="R"/>
	<bitfield id="OOT3" width="1" begin="2" end="2" resetval="0x0" description="ADC results safety checker 3 out-of-tolerance flag.  Set when CHECK3 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="2" rwaccess="R"/>
	<bitfield id="OOT2" width="1" begin="1" end="1" resetval="0x0" description="ADC results safety checker 2 out-of-tolerance flag.  Set when CHECK2 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="1" rwaccess="R"/>
	<bitfield id="OOT1" width="1" begin="0" end="0" resetval="0x0" description="ADC results safety checker 1 out-of-tolerance flag.  Set when CHECK1 detects a difference between configured conversion results greater than the configured tolerance.  Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="0" rwaccess="R"/>
	</register><register id="ADC_SAFETY_AGGR_OOTFLGCLR" acronym="ADC_SAFETY_AGGR_OOTFLGCLR" offset="4" width="32" description="Checker Out-of-Tolerance Flag Clear Register.">
		<bitfield id="OOT12" width="1" begin="11" end="11" resetval="0x0" description="ADC results safety checker 12 out-of-tolerance flag clear.  Used to clear OOT status from CHECK12.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="11" rwaccess="R/W1TS"/>
	<bitfield id="OOT11" width="1" begin="10" end="10" resetval="0x0" description="ADC results safety checker 11 out-of-tolerance flag clear.  Used to clear OOT status from CHECK11.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="10" rwaccess="R/W1TS"/>
	<bitfield id="OOT10" width="1" begin="9" end="9" resetval="0x0" description="ADC results safety checker 10 out-of-tolerance flag clear.  Used to clear OOT status from CHECK10.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="9" rwaccess="R/W1TS"/>
	<bitfield id="OOT9" width="1" begin="8" end="8" resetval="0x0" description="ADC results safety checker 9 out-of-tolerance flag clear.  Used to clear OOT status from CHECK9.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="8" rwaccess="R/W1TS"/>
	<bitfield id="OOT8" width="1" begin="7" end="7" resetval="0x0" description="ADC results safety checker 8 out-of-tolerance flag clear.  Used to clear OOT status from CHECK8.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="7" rwaccess="R/W1TS"/>
	<bitfield id="OOT7" width="1" begin="6" end="6" resetval="0x0" description="ADC results safety checker 7 out-of-tolerance flag clear.  Used to clear OOT status from CHECK7.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="6" rwaccess="R/W1TS"/>
	<bitfield id="OOT6" width="1" begin="5" end="5" resetval="0x0" description="ADC results safety checker 6 out-of-tolerance flag clear.  Used to clear OOT status from CHECK6.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="5" rwaccess="R/W1TS"/>
	<bitfield id="OOT5" width="1" begin="4" end="4" resetval="0x0" description="ADC results safety checker 5 out-of-tolerance flag clear.  Used to clear OOT status from CHECK5.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="4" rwaccess="R/W1TS"/>
	<bitfield id="OOT4" width="1" begin="3" end="3" resetval="0x0" description="ADC results safety checker 4 out-of-tolerance flag clear.  Used to clear OOT status from CHECK4.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="3" rwaccess="R/W1TS"/>
	<bitfield id="OOT3" width="1" begin="2" end="2" resetval="0x0" description="ADC results safety checker 3 out-of-tolerance flag clear.  Used to clear OOT status from CHECK3.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="2" rwaccess="R/W1TS"/>
	<bitfield id="OOT2" width="1" begin="1" end="1" resetval="0x0" description="ADC results safety checker 2 out-of-tolerance flag clear.  Used to clear OOT status from CHECK2.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="1" rwaccess="R/W1TS"/>
	<bitfield id="OOT1" width="1" begin="0" end="0" resetval="0x0" description="ADC results safety checker 1 out-of-tolerance flag clear.  Used to clear OOT status from CHECK1.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="0" rwaccess="R/W1TS"/>
	</register><register id="ADC_SAFETY_AGGR_RES1OVF" acronym="ADC_SAFETY_AGGR_RES1OVF" offset="8" width="32" description="Checker Overflow Result 1 Flag Register.">
		<bitfield id="RES1OVF12" width="1" begin="11" end="11" resetval="0x0" description="ADC results safety checker 12 overflow flag for result 1.  Set when CHECK12 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="11" rwaccess="R"/>
	<bitfield id="RES1OVF11" width="1" begin="10" end="10" resetval="0x0" description="ADC results safety checker 11 overflow flag for result 1.  Set when CHECK11 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="10" rwaccess="R"/>
	<bitfield id="RES1OVF10" width="1" begin="9" end="9" resetval="0x0" description="ADC results safety checker 10 overflow flag for result 1.  Set when CHECK10 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="9" rwaccess="R"/>
	<bitfield id="RES1OVF9" width="1" begin="8" end="8" resetval="0x0" description="ADC results safety checker 9 overflow flag for result 1.  Set when CHECK9 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="8" rwaccess="R"/>
	<bitfield id="RES1OVF8" width="1" begin="7" end="7" resetval="0x0" description="ADC results safety checker 8 overflow flag for result 1.  Set when CHECK8 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="7" rwaccess="R"/>
	<bitfield id="RES1OVF7" width="1" begin="6" end="6" resetval="0x0" description="ADC results safety checker 7 overflow flag for result 1.  Set when CHECK7 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="6" rwaccess="R"/>
	<bitfield id="RES1OVF6" width="1" begin="5" end="5" resetval="0x0" description="ADC results safety checker 6 overflow flag for result 1.  Set when CHECK6 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="5" rwaccess="R"/>
	<bitfield id="RES1OVF5" width="1" begin="4" end="4" resetval="0x0" description="ADC results safety checker 5 overflow flag for result 1.  Set when CHECK5 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="4" rwaccess="R"/>
	<bitfield id="RES1OVF4" width="1" begin="3" end="3" resetval="0x0" description="ADC results safety checker 4 overflow flag for result 1.  Set when CHECK4 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="3" rwaccess="R"/>
	<bitfield id="RES1OVF3" width="1" begin="2" end="2" resetval="0x0" description="ADC results safety checker 3 overflow flag for result 1.  Set when CHECK3 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="2" rwaccess="R"/>
	<bitfield id="RES1OVF2" width="1" begin="1" end="1" resetval="0x0" description="ADC results safety checker 2 overflow flag for result 1.  Set when CHECK2 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="1" rwaccess="R"/>
	<bitfield id="RES1OVF1" width="1" begin="0" end="0" resetval="0x0" description="ADC results safety checker 1 overflow flag for result 1.  Set when CHECK1 detects that conversion result 1 has arrived more than once before result 2 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="0" rwaccess="R"/>
	</register><register id="ADC_SAFETY_AGGR_RES1OVFCLR" acronym="ADC_SAFETY_AGGR_RES1OVFCLR" offset="12" width="32" description="Checker Overflow Result 1 Flag Clear Register.">
		<bitfield id="RES1OVF12" width="1" begin="11" end="11" resetval="0x0" description="ADC results safety checker 12 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK12.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="11" rwaccess="R/W1TS"/>
	<bitfield id="RES1OVF11" width="1" begin="10" end="10" resetval="0x0" description="ADC results safety checker 11 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK11.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="10" rwaccess="R/W1TS"/>
	<bitfield id="RES1OVF10" width="1" begin="9" end="9" resetval="0x0" description="ADC results safety checker 10 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK10.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="9" rwaccess="R/W1TS"/>
	<bitfield id="RES1OVF9" width="1" begin="8" end="8" resetval="0x0" description="ADC results safety checker 9 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK9.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="8" rwaccess="R/W1TS"/>
	<bitfield id="RES1OVF8" width="1" begin="7" end="7" resetval="0x0" description="ADC results safety checker 8 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK8.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="7" rwaccess="R/W1TS"/>
	<bitfield id="RES1OVF7" width="1" begin="6" end="6" resetval="0x0" description="ADC results safety checker 7 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK7.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="6" rwaccess="R/W1TS"/>
	<bitfield id="RES1OVF6" width="1" begin="5" end="5" resetval="0x0" description="ADC results safety checker 6 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK6.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="5" rwaccess="R/W1TS"/>
	<bitfield id="RES1OVF5" width="1" begin="4" end="4" resetval="0x0" description="ADC results safety checker 5 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK5.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="4" rwaccess="R/W1TS"/>
	<bitfield id="RES1OVF4" width="1" begin="3" end="3" resetval="0x0" description="ADC results safety checker 4 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK4.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="3" rwaccess="R/W1TS"/>
	<bitfield id="RES1OVF3" width="1" begin="2" end="2" resetval="0x0" description="ADC results safety checker 3 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK3.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="2" rwaccess="R/W1TS"/>
	<bitfield id="RES1OVF2" width="1" begin="1" end="1" resetval="0x0" description="ADC results safety checker 2 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK2.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="1" rwaccess="R/W1TS"/>
