ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/ADC_SAFETY_ADC_SAFETY_AGGR_502CEC00h.xml
	<bitfield id="RES1OVF1" width="1" begin="0" end="0" resetval="0x0" description="ADC results safety checker 1 result 1 overflow flag clear.  Used to clear RES1OVF status from CHECK1.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="0" rwaccess="R/W1TS"/>
	</register><register id="ADC_SAFETY_AGGR_RES2OVF" acronym="ADC_SAFETY_AGGR_RES2OVF" offset="16" width="32" description="Checker Overflow Result 2 Flag Register.">
		<bitfield id="RES2OVF12" width="1" begin="11" end="11" resetval="0x0" description="ADC results safety checker 12 overflow flag for result 2.  Set when CHECK12 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="11" rwaccess="R"/>
	<bitfield id="RES2OVF11" width="1" begin="10" end="10" resetval="0x0" description="ADC results safety checker 11 overflow flag for result 2.  Set when CHECK11 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="10" rwaccess="R"/>
	<bitfield id="RES2OVF10" width="1" begin="9" end="9" resetval="0x0" description="ADC results safety checker 10 overflow flag for result 2.  Set when CHECK10 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="9" rwaccess="R"/>
	<bitfield id="RES2OVF9" width="1" begin="8" end="8" resetval="0x0" description="ADC results safety checker 9 overflow flag for result 2.  Set when CHECK9 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="8" rwaccess="R"/>
	<bitfield id="RES2OVF8" width="1" begin="7" end="7" resetval="0x0" description="ADC results safety checker 8 overflow flag for result 2.  Set when CHECK8 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="7" rwaccess="R"/>
	<bitfield id="RES2OVF7" width="1" begin="6" end="6" resetval="0x0" description="ADC results safety checker 7 overflow flag for result 2.  Set when CHECK7 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="6" rwaccess="R"/>
	<bitfield id="RES2OVF6" width="1" begin="5" end="5" resetval="0x0" description="ADC results safety checker 6 overflow flag for result 2.  Set when CHECK6 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="5" rwaccess="R"/>
	<bitfield id="RES2OVF5" width="1" begin="4" end="4" resetval="0x0" description="ADC results safety checker 5 overflow flag for result 2.  Set when CHECK5 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="4" rwaccess="R"/>
	<bitfield id="RES2OVF4" width="1" begin="3" end="3" resetval="0x0" description="ADC results safety checker 4 overflow flag for result 2.  Set when CHECK4 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="3" rwaccess="R"/>
	<bitfield id="RES2OVF3" width="1" begin="2" end="2" resetval="0x0" description="ADC results safety checker 3 overflow flag for result 2.  Set when CHECK3 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="2" rwaccess="R"/>
	<bitfield id="RES2OVF2" width="1" begin="1" end="1" resetval="0x0" description="ADC results safety checker 2 overflow flag for result 2.  Set when CHECK2 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="1" rwaccess="R"/>
	<bitfield id="RES2OVF1" width="1" begin="0" end="0" resetval="0x0" description="ADC results safety checker 1 overflow flag for result 2.  Set when CHECK1 detects that conversion result 2 has arrived more than once before result 1 has arrived.    Use the CHECKINTSEL1, CHECKINTSEL2, CHECKINTSEL3, CHECKEVTxSEL1, CHECKEVTxSEL2, and CHECKEVTxSEL3 registers to aggregate detected OOT and OVF flags into interrupt [INT] or X-bar events [EVT].  " range="0" rwaccess="R"/>
	</register><register id="ADC_SAFETY_AGGR_RES2OVFCLR" acronym="ADC_SAFETY_AGGR_RES2OVFCLR" offset="20" width="32" description="Checker Overflow Result 2 Flag Clear Register.">
		<bitfield id="RES2OVF12" width="1" begin="11" end="11" resetval="0x0" description="ADC results safety checker 12 result overflow flag clear.  Used to clear OVF status from CHECK12.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHECKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="11" rwaccess="R/W1TS"/>
	<bitfield id="RES2OVF11" width="1" begin="10" end="10" resetval="0x0" description="ADC results safety checker 11 result overflow flag clear.  Used to clear OVF status from CHECK11.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHECKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="10" rwaccess="R/W1TS"/>
	<bitfield id="RES2OVF10" width="1" begin="9" end="9" resetval="0x0" description="ADC results safety checker 10 result overflow flag clear.  Used to clear OVF status from CHECK10.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHECKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="9" rwaccess="R/W1TS"/>
	<bitfield id="RES2OVF9" width="1" begin="8" end="8" resetval="0x0" description="ADC results safety checker 9 result overflow flag clear.  Used to clear OVF status from CHECK9.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="8" rwaccess="R/W1TS"/>
	<bitfield id="RES2OVF8" width="1" begin="7" end="7" resetval="0x0" description="ADC results safety checker 8 result overflow flag clear.  Used to clear OVF status from CHECK8.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHECKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="7" rwaccess="R/W1TS"/>
	<bitfield id="RES2OVF7" width="1" begin="6" end="6" resetval="0x0" description="ADC results safety checker 7 result overflow flag clear.  Used to clear OVF status from CHECK7.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHECKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="6" rwaccess="R/W1TS"/>
	<bitfield id="RES2OVF6" width="1" begin="5" end="5" resetval="0x0" description="ADC results safety checker 6 result overflow flag clear.  Used to clear OVF status from CHECK6.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHECKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="5" rwaccess="R/W1TS"/>
	<bitfield id="RES2OVF5" width="1" begin="4" end="4" resetval="0x0" description="ADC results safety checker 5 result overflow flag clear.  Used to clear OVF status from CHECK5.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="4" rwaccess="R/W1TS"/>
	<bitfield id="RES2OVF4" width="1" begin="3" end="3" resetval="0x0" description="ADC results safety checker 4 result overflow flag clear.  Used to clear OVF status from CHECK4.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHECKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="3" rwaccess="R/W1TS"/>
	<bitfield id="RES2OVF3" width="1" begin="2" end="2" resetval="0x0" description="ADC results safety checker 3 result overflow flag clear.  Used to clear OVF status from CHECK3.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHECKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="2" rwaccess="R/W1TS"/>
	<bitfield id="RES2OVF2" width="1" begin="1" end="1" resetval="0x0" description="ADC results safety checker 2 result overflow flag clear.  Used to clear OVF status from CHECK2.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHECKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="1" rwaccess="R/W1TS"/>
	<bitfield id="RES2OVF1" width="1" begin="0" end="0" resetval="0x0" description="ADC results safety checker 1 result overflow flag clear.  Used to clear OVF status from CHECK1.    In the case of a safety checker interrupt, clear all serviced OOT or OVF flags first, then clear the global interrupt flag [in the CHECKINTFLG register] using the CHKINTFLGCLR register.  In the case of a safety checker X-bar event, clear all associated OOT or OVF flags to clear the event.      " range="0" rwaccess="R/W1TS"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKINTFLG" acronym="ADC_SAFETY_AGGR_CHECKINTFLG" offset="24" width="16" description="Checker Interrupt Flag Register.">
		<bitfield id="CHECKINT" width="1" begin="0" end="0" resetval="0x0" description="ADC results safety checker subsytem interrupt flag.  Indicates that one or more configured OOT or OVF conditions have occurred in the individual safety checker modules.    In the ISR, clear all serviced OOT or OVF flags first [using the OOTFLGCLR and OVFFLGCLR registers], then clear this flag using the CHKINTFLGCLR register.  The CHECKINTSEL1 and CHECKINTSEL2 registers are used to select which OOT and OVF flags from the individual checker modules can trigger this interrupt. " range="0" rwaccess="R"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKINTFLGCLR" acronym="ADC_SAFETY_AGGR_CHECKINTFLGCLR" offset="28" width="16" description="Checker Interrupt Flag Clear Register.">
		<bitfield id="CHECKINTCLR" width="1" begin="0" end="0" resetval="0x0" description="ADC results safety checker subsytem interrupt flag clear.  Used to clear the global safety checker subsystem interrupt flag.  In the ISR, clear all serviced OOT or OVF flags first [using the OOTFLGCLR and OVFFLGCLR registers], then clear the global CHECKINT flag using the this register." range="0" rwaccess="R/W1TS"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKINTSEL1" acronym="ADC_SAFETY_AGGR_CHECKINTSEL1" offset="32" width="32" description="Checker Interrupt Source Select Register 1">
		<bitfield id="RES1OVF12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 RES1OVF as a source for CHECKINT. " range="11" rwaccess="R/W"/>
	<bitfield id="RES1OVF11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 RES1OVF as a source for CHECKINT. " range="10" rwaccess="R/W"/>
	<bitfield id="RES1OVF10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 RES1OVF as a source for CHECKINT. " range="9" rwaccess="R/W"/>
	<bitfield id="RES1OVF9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 RES1OVF as a source for CHECKINT. " range="8" rwaccess="R/W"/>
	<bitfield id="RES1OVF8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 RES1OVF as a source for CHECKINT. " range="7" rwaccess="R/W"/>
	<bitfield id="RES1OVF7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 RES1OVF as a source for CHECKINT. " range="6" rwaccess="R/W"/>
	<bitfield id="RES1OVF6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 RES1OVF as a source for CHECKINT. " range="5" rwaccess="R/W"/>
	<bitfield id="RES1OVF5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 RES1OVF as a source for CHECKINT. " range="4" rwaccess="R/W"/>
	<bitfield id="RES1OVF4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 RES1OVF as a source for CHECKINT. " range="3" rwaccess="R/W"/>
	<bitfield id="RES1OVF3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 RES1OVF as a source for CHECKINT. " range="2" rwaccess="R/W"/>
	<bitfield id="RES1OVF2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 RES1OVF as a source for CHECKINT. " range="1" rwaccess="R/W"/>
	<bitfield id="RES1OVF1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 RES1OVF as a source for CHECKINT. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKINTSEL2" acronym="ADC_SAFETY_AGGR_CHECKINTSEL2" offset="36" width="32" description="Checker Interrupt Source Select Register 2">
		<bitfield id="RES2OVF12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 RES2OVF as a source for CHECKINT. " range="11" rwaccess="R/W"/>
	<bitfield id="RES2OVF11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 RES2OVF as a source for CHECKINT. " range="10" rwaccess="R/W"/>
	<bitfield id="RES2OVF10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 RES2OVF as a source for CHECKINT. " range="9" rwaccess="R/W"/>
	<bitfield id="RES2OVF9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 RES2OVF as a source for CHECKINT. " range="8" rwaccess="R/W"/>
	<bitfield id="RES2OVF8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 RES2OVF as a source for CHECKINT. " range="7" rwaccess="R/W"/>
	<bitfield id="RES2OVF7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 RES2OVF as a source for CHECKINT. " range="6" rwaccess="R/W"/>
	<bitfield id="RES2OVF6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 RES2OVF as a source for CHECKINT. " range="5" rwaccess="R/W"/>
	<bitfield id="RES2OVF5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 RES2OVF as a source for CHECKINT. " range="4" rwaccess="R/W"/>
	<bitfield id="RES2OVF4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 RES2OVF as a source for CHECKINT. " range="3" rwaccess="R/W"/>
	<bitfield id="RES2OVF3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 RES2OVF as a source for CHECKINT. " range="2" rwaccess="R/W"/>
	<bitfield id="RES2OVF2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 RES2OVF as a source for CHECKINT. " range="1" rwaccess="R/W"/>
	<bitfield id="RES2OVF1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 RES2OVF as a source for CHECKINT. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKINTSEL3" acronym="ADC_SAFETY_AGGR_CHECKINTSEL3" offset="40" width="32" description="Checker Interrupt Source Select Register 3">
		<bitfield id="OOT12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 OOT as a source for CHECKINT. " range="11" rwaccess="R/W"/>
	<bitfield id="OOT11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 OOT as a source for CHECKINT. " range="10" rwaccess="R/W"/>
	<bitfield id="OOT10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 OOT as a source for CHECKINT. " range="9" rwaccess="R/W"/>
	<bitfield id="OOT9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 OOT as a source for CHECKINT. " range="8" rwaccess="R/W"/>
	<bitfield id="OOT8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 OOT as a source for CHECKINT. " range="7" rwaccess="R/W"/>
	<bitfield id="OOT7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 OOT as a source for CHECKINT. " range="6" rwaccess="R/W"/>
	<bitfield id="OOT6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 OOT as a source for CHECKINT. " range="5" rwaccess="R/W"/>
	<bitfield id="OOT5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 OOT as a source for CHECKINT. " range="4" rwaccess="R/W"/>
	<bitfield id="OOT4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 OOT as a source for CHECKINT. " range="3" rwaccess="R/W"/>
	<bitfield id="OOT3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 OOT as a source for CHECKINT. " range="2" rwaccess="R/W"/>
	<bitfield id="OOT2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 OOT as a source for CHECKINT. " range="1" rwaccess="R/W"/>
	<bitfield id="OOT1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 OOT as a source for CHECKINT. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT1SEL1" acronym="ADC_SAFETY_AGGR_CHECKEVT1SEL1" offset="48" width="32" description="Checker X-Bar EVT1 Source Select Register 1">
		<bitfield id="RES1OVF12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 RES1OVF as a source for CHECKEVT1. " range="11" rwaccess="R/W"/>
	<bitfield id="RES1OVF11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 RES1OVF as a source for CHECKEVT1. " range="10" rwaccess="R/W"/>
	<bitfield id="RES1OVF10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 RES1OVF as a source for CHECKEVT1. " range="9" rwaccess="R/W"/>
	<bitfield id="RES1OVF9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 RES1OVF as a source for CHECKEVT1. " range="8" rwaccess="R/W"/>
	<bitfield id="RES1OVF8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 RES1OVF as a source for CHECKEVT1. " range="7" rwaccess="R/W"/>
	<bitfield id="RES1OVF7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 RES1OVF as a source for CHECKEVT1. " range="6" rwaccess="R/W"/>
	<bitfield id="RES1OVF6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 RES1OVF as a source for CHECKEVT1. " range="5" rwaccess="R/W"/>
	<bitfield id="RES1OVF5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 RES1OVF as a source for CHECKEVT1. " range="4" rwaccess="R/W"/>
	<bitfield id="RES1OVF4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 RES1OVF as a source for CHECKEVT1. " range="3" rwaccess="R/W"/>
	<bitfield id="RES1OVF3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 RES1OVF as a source for CHECKEVT1. " range="2" rwaccess="R/W"/>
	<bitfield id="RES1OVF2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 RES1OVF as a source for CHECKEVT1. " range="1" rwaccess="R/W"/>
	<bitfield id="RES1OVF1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 RES1OVF as a source for CHECKEVT1. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT1SEL2" acronym="ADC_SAFETY_AGGR_CHECKEVT1SEL2" offset="52" width="32" description="Checker X-Bar EVT1 Source Select Register 2">
		<bitfield id="RES2OVF12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 RES2OVF as a source for CHECKEVT1. " range="11" rwaccess="R/W"/>
	<bitfield id="RES2OVF11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 RES2OVF as a source for CHECKEVT1. " range="10" rwaccess="R/W"/>
	<bitfield id="RES2OVF10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 RES2OVF as a source for CHECKEVT1. " range="9" rwaccess="R/W"/>
	<bitfield id="RES2OVF9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 RES2OVF as a source for CHECKEVT1. " range="8" rwaccess="R/W"/>
	<bitfield id="RES2OVF8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 RES2OVF as a source for CHECKEVT1. " range="7" rwaccess="R/W"/>
	<bitfield id="RES2OVF7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 RES2OVF as a source for CHECKEVT1. " range="6" rwaccess="R/W"/>
	<bitfield id="RES2OVF6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 RES2OVF as a source for CHECKEVT1. " range="5" rwaccess="R/W"/>
	<bitfield id="RES2OVF5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 RES2OVF as a source for CHECKEVT1. " range="4" rwaccess="R/W"/>
	<bitfield id="RES2OVF4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 RES2OVF as a source for CHECKEVT1. " range="3" rwaccess="R/W"/>
