ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/AM263P/ADC_SAFETY_ADC_SAFETY_AGGR_502CEC00h.xml
	<bitfield id="RES2OVF3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 RES2OVF as a source for CHECKEVT1. " range="2" rwaccess="R/W"/>
	<bitfield id="RES2OVF2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 RES2OVF as a source for CHECKEVT1. " range="1" rwaccess="R/W"/>
	<bitfield id="RES2OVF1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 RES2OVF as a source for CHECKEVT1. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT1SEL3" acronym="ADC_SAFETY_AGGR_CHECKEVT1SEL3" offset="56" width="32" description="Checker X-Bar EVT1 Source Select Register 3">
		<bitfield id="OOT12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 OOT as a source for CHECKEVT1. " range="11" rwaccess="R/W"/>
	<bitfield id="OOT11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 OOTas a source for CHECKEVT1. " range="10" rwaccess="R/W"/>
	<bitfield id="OOT10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 OOT as a source for CHECKEVT1. " range="9" rwaccess="R/W"/>
	<bitfield id="OOT9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 OOT as a source for CHECKEVT1. " range="8" rwaccess="R/W"/>
	<bitfield id="OOT8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 OOT as a source for CHECKEVT1. " range="7" rwaccess="R/W"/>
	<bitfield id="OOT7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 OOTas a source for CHECKEVT1. " range="6" rwaccess="R/W"/>
	<bitfield id="OOT6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 OOT as a source for CHECKEVT1. " range="5" rwaccess="R/W"/>
	<bitfield id="OOT5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 OOT as a source for CHECKEVT1. " range="4" rwaccess="R/W"/>
	<bitfield id="OOT4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 OOT as a source for CHECKEVT1. " range="3" rwaccess="R/W"/>
	<bitfield id="OOT3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 OOTas a source for CHECKEVT1. " range="2" rwaccess="R/W"/>
	<bitfield id="OOT2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 OOT as a source for CHECKEVT1. " range="1" rwaccess="R/W"/>
	<bitfield id="OOT1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 OOT as a source for CHECKEVT1. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT2SEL1" acronym="ADC_SAFETY_AGGR_CHECKEVT2SEL1" offset="64" width="32" description="Checker X-Bar EVT2 Source Select Register 1">
		<bitfield id="RES1OVF12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 RES1OVF as a source for CHECKEVT2. " range="11" rwaccess="R/W"/>
	<bitfield id="RES1OVF11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 RES1OVF as a source for CHECKEVT2. " range="10" rwaccess="R/W"/>
	<bitfield id="RES1OVF10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 RES1OVF as a source for CHECKEVT2. " range="9" rwaccess="R/W"/>
	<bitfield id="RES1OVF9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 RES1OVF as a source for CHECKEVT2. " range="8" rwaccess="R/W"/>
	<bitfield id="RES1OVF8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 RES1OVF as a source for CHECKEVT2. " range="7" rwaccess="R/W"/>
	<bitfield id="RES1OVF7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 RES1OVF as a source for CHECKEVT2. " range="6" rwaccess="R/W"/>
	<bitfield id="RES1OVF6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 RES1OVF as a source for CHECKEVT2. " range="5" rwaccess="R/W"/>
	<bitfield id="RES1OVF5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 RES1OVF as a source for CHECKEVT2. " range="4" rwaccess="R/W"/>
	<bitfield id="RES1OVF4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 RES1OVF as a source for CHECKEVT2. " range="3" rwaccess="R/W"/>
	<bitfield id="RES1OVF3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 RES1OVF as a source for CHECKEVT2. " range="2" rwaccess="R/W"/>
	<bitfield id="RES1OVF2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 RES1OVF as a source for CHECKEVT2. " range="1" rwaccess="R/W"/>
	<bitfield id="RES1OVF1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 RES1OVF as a source for CHECKEVT2. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT2SEL2" acronym="ADC_SAFETY_AGGR_CHECKEVT2SEL2" offset="68" width="32" description="Checker X-Bar EVT2 Source Select Register 2">
		<bitfield id="RES2OVF12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 RES2OVF as a source for CHECKEVT2. " range="11" rwaccess="R/W"/>
	<bitfield id="RES2OVF11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 RES2OVF as a source for CHECKEVT2. " range="10" rwaccess="R/W"/>
	<bitfield id="RES2OVF10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 RES2OVF as a source for CHECKEVT2. " range="9" rwaccess="R/W"/>
	<bitfield id="RES2OVF9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 RES2OVF as a source for CHECKEVT2. " range="8" rwaccess="R/W"/>
	<bitfield id="RES2OVF8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 RES2OVF as a source for CHECKEVT2. " range="7" rwaccess="R/W"/>
	<bitfield id="RES2OVF7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 RES2OVF as a source for CHECKEVT2. " range="6" rwaccess="R/W"/>
	<bitfield id="RES2OVF6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 RES2OVF as a source for CHECKEVT2. " range="5" rwaccess="R/W"/>
	<bitfield id="RES2OVF5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 RES2OVF as a source for CHECKEVT2. " range="4" rwaccess="R/W"/>
	<bitfield id="RES2OVF4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 RES2OVF as a source for CHECKEVT2. " range="3" rwaccess="R/W"/>
	<bitfield id="RES2OVF3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 RES2OVF as a source for CHECKEVT2. " range="2" rwaccess="R/W"/>
	<bitfield id="RES2OVF2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 RES2OVF as a source for CHECKEVT2. " range="1" rwaccess="R/W"/>
	<bitfield id="RES2OVF1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 RES2OVF as a source for CHECKEVT2. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT2SEL3" acronym="ADC_SAFETY_AGGR_CHECKEVT2SEL3" offset="72" width="32" description="Checker X-Bar EVT2 Source Select Register 3">
		<bitfield id="OOT12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 OOT as a source for CHECKEVT2. " range="11" rwaccess="R/W"/>
	<bitfield id="OOT11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 OOTas a source for CHECKEVT2. " range="10" rwaccess="R/W"/>
	<bitfield id="OOT10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 OOT as a source for CHECKEVT2. " range="9" rwaccess="R/W"/>
	<bitfield id="OOT9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 OOT as a source for CHECKEVT2. " range="8" rwaccess="R/W"/>
	<bitfield id="OOT8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 OOT as a source for CHECKEVT2. " range="7" rwaccess="R/W"/>
	<bitfield id="OOT7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 OOTas a source for CHECKEVT2. " range="6" rwaccess="R/W"/>
	<bitfield id="OOT6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 OOT as a source for CHECKEVT2. " range="5" rwaccess="R/W"/>
	<bitfield id="OOT5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 OOT as a source for CHECKEVT2. " range="4" rwaccess="R/W"/>
	<bitfield id="OOT4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 OOT as a source for CHECKEVT2. " range="3" rwaccess="R/W"/>
	<bitfield id="OOT3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 OOTas a source for CHECKEVT2. " range="2" rwaccess="R/W"/>
	<bitfield id="OOT2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 OOT as a source for CHECKEVT2. " range="1" rwaccess="R/W"/>
	<bitfield id="OOT1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 OOT as a source for CHECKEVT2. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT3SEL1" acronym="ADC_SAFETY_AGGR_CHECKEVT3SEL1" offset="80" width="32" description="Checker X-Bar EVT3 Source Select Register 1">
		<bitfield id="RES1OVF12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 RES1OVF as a source for CHECKEVT3. " range="11" rwaccess="R/W"/>
	<bitfield id="RES1OVF11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 RES1OVF as a source for CHECKEVT3. " range="10" rwaccess="R/W"/>
	<bitfield id="RES1OVF10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 RES1OVF as a source for CHECKEVT3. " range="9" rwaccess="R/W"/>
	<bitfield id="RES1OVF9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 RES1OVF as a source for CHECKEVT3. " range="8" rwaccess="R/W"/>
	<bitfield id="RES1OVF8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 RES1OVF as a source for CHECKEVT3. " range="7" rwaccess="R/W"/>
	<bitfield id="RES1OVF7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 RES1OVF as a source for CHECKEVT3. " range="6" rwaccess="R/W"/>
	<bitfield id="RES1OVF6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 RES1OVF as a source for CHECKEVT3. " range="5" rwaccess="R/W"/>
	<bitfield id="RES1OVF5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 RES1OVF as a source for CHECKEVT3. " range="4" rwaccess="R/W"/>
	<bitfield id="RES1OVF4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 RES1OVF as a source for CHECKEVT3. " range="3" rwaccess="R/W"/>
	<bitfield id="RES1OVF3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 RES1OVF as a source for CHECKEVT3. " range="2" rwaccess="R/W"/>
	<bitfield id="RES1OVF2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 RES1OVF as a source for CHECKEVT3. " range="1" rwaccess="R/W"/>
	<bitfield id="RES1OVF1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 RES1OVF as a source for CHECKEVT3. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT3SEL2" acronym="ADC_SAFETY_AGGR_CHECKEVT3SEL2" offset="84" width="32" description="Checker X-Bar EVT3 Source Select Register 2">
		<bitfield id="RES2OVF12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 RES2OVF as a source for CHECKEVT3. " range="11" rwaccess="R/W"/>
	<bitfield id="RES2OVF11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 RES2OVF as a source for CHECKEVT3. " range="10" rwaccess="R/W"/>
	<bitfield id="RES2OVF10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 RES2OVF as a source for CHECKEVT3. " range="9" rwaccess="R/W"/>
	<bitfield id="RES2OVF9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 RES2OVF as a source for CHECKEVT3. " range="8" rwaccess="R/W"/>
	<bitfield id="RES2OVF8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 RES2OVF as a source for CHECKEVT3. " range="7" rwaccess="R/W"/>
	<bitfield id="RES2OVF7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 RES2OVF as a source for CHECKEVT3. " range="6" rwaccess="R/W"/>
	<bitfield id="RES2OVF6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 RES2OVF as a source for CHECKEVT3. " range="5" rwaccess="R/W"/>
	<bitfield id="RES2OVF5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 RES2OVF as a source for CHECKEVT3. " range="4" rwaccess="R/W"/>
	<bitfield id="RES2OVF4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 RES2OVF as a source for CHECKEVT3. " range="3" rwaccess="R/W"/>
	<bitfield id="RES2OVF3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 RES2OVF as a source for CHECKEVT3. " range="2" rwaccess="R/W"/>
	<bitfield id="RES2OVF2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 RES2OVF as a source for CHECKEVT3. " range="1" rwaccess="R/W"/>
	<bitfield id="RES2OVF1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 RES2OVF as a source for CHECKEVT3. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT3SEL3" acronym="ADC_SAFETY_AGGR_CHECKEVT3SEL3" offset="88" width="32" description="Checker X-Bar EVT3 Source Select Register 3">
		<bitfield id="OOT12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 OOT as a source for CHECKEVT3. " range="11" rwaccess="R/W"/>
	<bitfield id="OOT11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 OOTas a source for CHECKEVT3. " range="10" rwaccess="R/W"/>
	<bitfield id="OOT10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 OOT as a source for CHECKEVT3. " range="9" rwaccess="R/W"/>
	<bitfield id="OOT9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 OOT as a source for CHECKEVT3. " range="8" rwaccess="R/W"/>
	<bitfield id="OOT8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 OOT as a source for CHECKEVT3. " range="7" rwaccess="R/W"/>
	<bitfield id="OOT7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 OOTas a source for CHECKEVT3. " range="6" rwaccess="R/W"/>
	<bitfield id="OOT6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 OOT as a source for CHECKEVT3. " range="5" rwaccess="R/W"/>
	<bitfield id="OOT5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 OOT as a source for CHECKEVT3. " range="4" rwaccess="R/W"/>
	<bitfield id="OOT4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 OOT as a source for CHECKEVT3. " range="3" rwaccess="R/W"/>
	<bitfield id="OOT3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 OOTas a source for CHECKEVT3. " range="2" rwaccess="R/W"/>
	<bitfield id="OOT2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 OOT as a source for CHECKEVT3. " range="1" rwaccess="R/W"/>
	<bitfield id="OOT1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 OOT as a source for CHECKEVT3. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT4SEL1" acronym="ADC_SAFETY_AGGR_CHECKEVT4SEL1" offset="96" width="32" description="Checker X-Bar EVT4 Source Select Register 1">
		<bitfield id="RES1OVF12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 RES1OVF as a source for CHECKEVT4. " range="11" rwaccess="R/W"/>
	<bitfield id="RES1OVF11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 RES1OVF as a source for CHECKEVT4. " range="10" rwaccess="R/W"/>
	<bitfield id="RES1OVF10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 RES1OVF as a source for CHECKEVT4. " range="9" rwaccess="R/W"/>
	<bitfield id="RES1OVF9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 RES1OVF as a source for CHECKEVT4. " range="8" rwaccess="R/W"/>
	<bitfield id="RES1OVF8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 RES1OVF as a source for CHECKEVT4. " range="7" rwaccess="R/W"/>
	<bitfield id="RES1OVF7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 RES1OVF as a source for CHECKEVT4. " range="6" rwaccess="R/W"/>
	<bitfield id="RES1OVF6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 RES1OVF as a source for CHECKEVT4. " range="5" rwaccess="R/W"/>
	<bitfield id="RES1OVF5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 RES1OVF as a source for CHECKEVT4. " range="4" rwaccess="R/W"/>
	<bitfield id="RES1OVF4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 RES1OVF as a source for CHECKEVT4. " range="3" rwaccess="R/W"/>
	<bitfield id="RES1OVF3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 RES1OVF as a source for CHECKEVT4. " range="2" rwaccess="R/W"/>
	<bitfield id="RES1OVF2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 RES1OVF as a source for CHECKEVT4. " range="1" rwaccess="R/W"/>
	<bitfield id="RES1OVF1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 RES1OVF as a source for CHECKEVT4. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT4SEL2" acronym="ADC_SAFETY_AGGR_CHECKEVT4SEL2" offset="100" width="32" description="Checker X-Bar EVT4 Source Select Register 2">
		<bitfield id="RES2OVF12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 RES2OVF as a source for CHECKEVT4. " range="11" rwaccess="R/W"/>
	<bitfield id="RES2OVF11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 RES2OVF as a source for CHECKEVT4. " range="10" rwaccess="R/W"/>
	<bitfield id="RES2OVF10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 RES2OVF as a source for CHECKEVT4. " range="9" rwaccess="R/W"/>
	<bitfield id="RES2OVF9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 RES2OVF as a source for CHECKEVT4. " range="8" rwaccess="R/W"/>
	<bitfield id="RES2OVF8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 RES2OVF as a source for CHECKEVT4. " range="7" rwaccess="R/W"/>
	<bitfield id="RES2OVF7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 RES2OVF as a source for CHECKEVT4. " range="6" rwaccess="R/W"/>
	<bitfield id="RES2OVF6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 RES2OVF as a source for CHECKEVT4. " range="5" rwaccess="R/W"/>
	<bitfield id="RES2OVF5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 RES2OVF as a source for CHECKEVT4. " range="4" rwaccess="R/W"/>
	<bitfield id="RES2OVF4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 RES2OVF as a source for CHECKEVT4. " range="3" rwaccess="R/W"/>
	<bitfield id="RES2OVF3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 RES2OVF as a source for CHECKEVT4. " range="2" rwaccess="R/W"/>
	<bitfield id="RES2OVF2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 RES2OVF as a source for CHECKEVT4. " range="1" rwaccess="R/W"/>
	<bitfield id="RES2OVF1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 RES2OVF as a source for CHECKEVT4. " range="0" rwaccess="R/W"/>
	</register><register id="ADC_SAFETY_AGGR_CHECKEVT4SEL3" acronym="ADC_SAFETY_AGGR_CHECKEVT4SEL3" offset="104" width="32" description="Checker X-Bar EVT4 Source Select Register 3">
		<bitfield id="OOT12EN" width="1" begin="11" end="11" resetval="0x0" description="Enable CHECK12 OOT as a source for CHECKEVT4. " range="11" rwaccess="R/W"/>
	<bitfield id="OOT11EN" width="1" begin="10" end="10" resetval="0x0" description="Enable CHECK11 OOTas a source for CHECKEVT4. " range="10" rwaccess="R/W"/>
	<bitfield id="OOT10EN" width="1" begin="9" end="9" resetval="0x0" description="Enable CHECK10 OOT as a source for CHECKEVT4. " range="9" rwaccess="R/W"/>
	<bitfield id="OOT9EN" width="1" begin="8" end="8" resetval="0x0" description="Enable CHECK9 OOT as a source for CHECKEVT4. " range="8" rwaccess="R/W"/>
	<bitfield id="OOT8EN" width="1" begin="7" end="7" resetval="0x0" description="Enable CHECK8 OOT as a source for CHECKEVT4. " range="7" rwaccess="R/W"/>
	<bitfield id="OOT7EN" width="1" begin="6" end="6" resetval="0x0" description="Enable CHECK7 OOTas a source for CHECKEVT4. " range="6" rwaccess="R/W"/>
	<bitfield id="OOT6EN" width="1" begin="5" end="5" resetval="0x0" description="Enable CHECK6 OOT as a source for CHECKEVT4. " range="5" rwaccess="R/W"/>
	<bitfield id="OOT5EN" width="1" begin="4" end="4" resetval="0x0" description="Enable CHECK5 OOT as a source for CHECKEVT4. " range="4" rwaccess="R/W"/>
	<bitfield id="OOT4EN" width="1" begin="3" end="3" resetval="0x0" description="Enable CHECK4 OOT as a source for CHECKEVT4. " range="3" rwaccess="R/W"/>
	<bitfield id="OOT3EN" width="1" begin="2" end="2" resetval="0x0" description="Enable CHECK3 OOTas a source for CHECKEVT4. " range="2" rwaccess="R/W"/>
	<bitfield id="OOT2EN" width="1" begin="1" end="1" resetval="0x0" description="Enable CHECK2 OOT as a source for CHECKEVT4. " range="1" rwaccess="R/W"/>
	<bitfield id="OOT1EN" width="1" begin="0" end="0" resetval="0x0" description="Enable CHECK1 OOT as a source for CHECKEVT4. " range="0" rwaccess="R/W"/>
	</register>
</module>